// 检验记录
export const WXYH_JYXM = [
  {
    value: '前桥',
    subItems: [
      {
        title: '前轴油污垢清洗情况',
        itemId: '0',
      },
      {
        title: '管轴各部几何尺寸检查情况',
        itemId: '0',
      },
      {
        title: '前轮毂及制动鼓检修情况',
        itemId: '0',
      },
      {
        title: '轮毂内外轴承',
        itemId: '0',
      },
      {
        title: '各部紧固及涂润滑脂情况',
        itemId: '0',
      },
      {
        title: '各部调整及其他情况',
        itemId: '0',
      },
      {
        title: '检查集中润滑齐全有效情况',
        itemId: '0',
      },
    ],
  },
  {
    value: '传动',
    subItems: [
      {
        title: '清洗传动各部零配件',
        itemId: '1',
      },
      {
        title: '检查各部件有无裂损',
        itemId: '1',
      },
      {
        title: '检修滑动叉及各突元叉',
        itemId: '1',
      },
      {
        title: '检修中间支撑轴情况',
        itemId: '1',
      },
      {
        title: '检修十字轴及轴承情况',
        itemId: '1',
      },
      {
        title: '检查轴承转动响动情况',
        itemId: '1',
      },
    ],
  }
];

// 验收单
export const WXYH_YSD = [
  {
    title: '发动机',
    items: [
      '水温正常', '机油压力正常', '气缸压力符合标准', '水温正常1', '机油压力正常1', '气缸压力符合标准1', '水温正常2', '机油压力正常2', '气缸压力符合标准2',
    ],
  },
  {
    title: '底盘',
    items: [
      '离合器工作正常', '变速器正常', '变速连接机构正常', '离合器工作正常1', '变速器正常1', '变速连接机构正常1', '离合器工作正常2', '变速器正常2', '变速连接机构正常2',
    ],
  },
  {
    title: '气路',
    items: [
      '气泵工作正常', '门包工作有效安装牢固', '气压表工作正常且读书准确', '气泵工作正常1', '门包工作有效安装牢固1', '气压表工作正常且读书准确1', '气泵工作正常2', '门包工作有效安装牢固2', '气压表工作正常且读书准确2'
    ],
  },
  {
    title: '电器',
    items: [
      '气泵工作正常', '门包工作有效安装牢固', '气压表工作正常且读书准确', '气泵工作正常1', '门包工作有效安装牢固1', '气压表工作正常且读书准确1', '气泵工作正常2', '门包工作有效安装牢固2', '气压表工作正常且读书准确2'
    ],
  },
  {
    title: '车身',
    items: [
      '气泵工作正常', '门包工作有效安装牢固', '气压表工作正常且读书准确', '气泵工作正常1', '门包工作有效安装牢固1', '气压表工作正常且读书准确1', '气泵工作正常2', '门包工作有效安装牢固2', '气压表工作正常且读书准确2'
    ],
  },
  {
    title: '路试',
    items: [
      '气泵工作正常', '门包工作有效安装牢固', '气压表工作正常且读书准确', '气泵工作正常1', '门包工作有效安装牢固1', '气压表工作正常且读书准确1', '气泵工作正常2', '门包工作有效安装牢固2', '气压表工作正常且读书准确2'
    ],
  },
];

const tableData = {
  WXYH_JYXM: WXYH_JYXM,
  WXYH_YSD: WXYH_YSD,
};

export default tableData;
